app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.page(params[:page]).per(5)